import Box from "../components/box";
import Layout from "../components/layout";

const About: React.FC = () => {
  return (
    <Layout headTitle="たまロックについて">
      <Box title="たまロックについて">
          <p>「たまロック」は、邦楽ロックを中心にすべてのアーティストを網羅したまったく新しい音楽メディアです。</p>
          <h3>なぜ立ち上げたの？</h3>
          <p>音楽メディアはすでに多数存在します。その中で、私が音楽メディアを立ち上げたのは、「もっと情報が整理されていたらいいな」と思ったからです。</p>
          <p>「好きなアーティストのイベントが終わってから気づいた」とか「マイナーバンドのニュースばかりで、必要な情報がほとんどない」と感じたことはないでしょうか。</p>
          <p>だから、音楽情報を1つに集約したサイトを作ろうと思いました！</p>
          <p>ニュース、Youtube、Twitter、Spotify、チケットサイトなどからアーティストの情報を網羅的に得ることができる。そんなサイトを目指しています。</p>
          <p></p>
          <h3>どんなアーティストでも検索可能</h3>
          <p>
            メニューの検索窓から好きなアーティスト名で検索してみてください。おそらく、ヒットするはずです。
            この検索結果は、Spotifyと連動しているため、Spotifyに登録している全アーティストが表示されます。
          </p>
          <p>
            検索方法も柔軟です。 例えば、「BLUE ENCOUNT」を「ブルエン」と検索することも可能ですし、「MAN WITH A MISSION」を「マンウィズ」と検索することも可能です。
            英語名を打ち込むのが面倒な人でも、気軽に検索できますよね。
          </p>
          <p>
            アーティストページには、そのアーティストの「Youtube」と「Spotify」が表示されます。
            <a href="/artists">アーティスト一覧</a>
            に表示されているアーティストには、「Twitter」と「ホームページリンク」も表示されるようになっています。
          </p>
          <h3>興味のあるニュースだけをピックアップ</h3>
          <p>たまロックでは、ニュース記事を配信しています。</p>
          <p>他の音楽メディアと違う点は、興味のあるニュースしか配信しないところです。なので、気になる音楽ニュースがなければ、数日間、更新しないこともあるかもしれません。</p>
          <p>個人でやっているメディアなので、毎日更新にこだわらず、本当に知りたい情報だけをお届けします。</p>
          <h3>コラム・ブログも配信予定</h3>
          <p>ニュースだけでなく、コラムやブログも配信する予定です。</p>
          <p>
            私は、音楽会社で働いているわけではないので、一人のユーザとして、現場の声を届けたいと思っています。アーティストへのインタビューなどはまだできませんが、みんなと同じ視点で、同じ距離感で語れることもあります。
          </p>
          <h3>これからも変わっていきます</h3>
          <p>たまロックは個人で運営しているため、数日単位で、サイトのデザインや仕組みがどんどん変わっていきます。</p>
          <p>まれにうまく動かないことや、わずらわしい動きをしてしまうこともあるかもしれませんが、どうか温かい目で見ていただければと思います。</p>
          <p>これからも、音楽情報を整理して、みなさんにお届けするために試行錯誤していきますので、よろしくお願いいたします。</p>
      </Box>
    </Layout>
  );
}

export default About;
